perf/tests/proxy/load_testing/load_testing_3.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 600

  phases:
    - name: Plain
      duration: 20
      arrivalRate: 0
    - name: Plain
      duration: 60
      arrivalRate: 500
    - name: Plain
      duration: 20
      arrivalRate: 0

scenarios:
  - name: load testing 3 (/)
    flow:
      - get:
          url: '/proxy'