perf/tests/proxy/load_testing/ramp.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50

  phases:
    - name: Plain
      duration: 20
      arrivalRate: 0
    - name: Ramp
      duration: 120
      arrivalRate: 1000
    - name: Plain
      duration: 20
      arrivalRate: 0

scenarios:
  - name: load testing 1 (/)
    flow:
      - get:
          url: '/proxy'